//1 --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let array = [1, 2, 3, 4, 5];
// let array2 = ["qqq", "www", "eee", "rrr", "ttt"];
// let array3 = ["21312", true, false, 111, 333];
// console.log(array);
// console.log(array2);
// console.log(array3);

// 2 - Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr = [];
// arr[0] = 1;
// arr[1] = 1;
// arr[2] = 1;
// arr[3] = 1;
// arr[4] = 1;
// console.log(arr);

// 3 - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// for (let i = 0; i < 11; i++) {
//     document.write(`<div>
//         erondondon
//     </div>`);
// }

// for (let i = 0; i < 10; i++) {
//     document.write(`<div> index - ${i} asdasdasd</div>`)
// }

// let i = 0;
// while ( i < 20){
//    document.write('<h1> 1231231</h1>');
//     i++;
// }
// while(i<20){
//     document.write(`<h1> asdsadasd  index-${i}  </h1>`);
//     i++;
// }

// 4 - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// arr1=[1,2,3,4,5,6,7,8,9,10];
// for (let i = 0; i < arr1.length; i++) {
//     console.log(arr1[i]);
// }
//
// arr2=['1','2','3','4','5','6','7','8','9','10'];
// for (let i = 0; i < arr2.length; i++) {
//     console.log(arr2[i]);
// }
// arr3=[true,false,false,6,8,4,'23123','13123', '12323', 123344];
// for (let i = 0; i < arr3.length; i++)
//     console.log(arr3[i]);

// arr4=[1,true,false,false,6,8,4,'23123','13123', '12323', 123344];
//
// for (let i = 0; i < arr4.length; i++) {
//     if (typeof arr4[i] === `boolean`)
//         console.log(arr4[i]);
// }

// arr5 = [11111,`aaaaaaa`,false,true,false,222222,33333,`bbbbbbb`,`qqq`,`www`];
// for (let i = 0; i < arr5.length; i++) {
//    if(typeof arr5[i] === `number`)
//        console.log(arr5[i]);
// }
//
// arr6 = [11111,`aaaaaaa`,false,true,false,222222,33333,`bbbbbbb`,`qqq`,`www`];
// for (let i = 0; i < arr6.length; i++) {
//     if(typeof arr6[i] === `string`)
//         console.log(arr6[i]);
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// let arr7 = [];
// arr7[0] = 213213;
// arr7[1] = `123`;
// arr7[2] = true;
// arr7[3] = false;
// arr7[4] = true;
// arr7[5] = 333;
// arr7[6] = 5555;
// arr7[7] = `666666`;
// arr7[8] = `rrr`;
// arr7[9] = `yyy`;
// arr7[10] = 10;
// for (let i = 0; i < arr7.length; i++) {
//     console.log(arr7[i]);
// }

// for (let i = 0; i < 11; i++) {
//     console.log(i);
//     document.write(`<p>${i}</p>`);
// }

// for (let i = 0; i < 101; i++) {
//     console.log(i);
//     document.write(`<p>${i}</p>`);
// }

// for (let i = 0; i < 101; i+=2) {
//     console.log(i);
//     document.write(`<p>${i}</p>`);
// }

// for (let i = 0; i < 101; i++) {
//     if (i % 2 === 0)
//         {
//             console.log(i);
//             document.write(`<p>${i}</p>`);
//         }
// }

// for (let i = 0; i < 101; i++) {
//     if (i % 2 != 0)
//     {
//         console.log(i);
//         document.write(`<p>${i}</p>`);
//     }
// }